## Basic Python

In [1]:
35

35

In [2]:
type(35)

int

In [3]:
2.5

2.5

In [4]:
type(2.5)

float

In [5]:
"strings"

'strings'

In [6]:
True

True

In [7]:
False

False

In [8]:
0

0

In [11]:
a = 5
a >= 0

True

In [12]:
a = [2,4,5]

In [13]:
a

[2, 4, 5]

In [14]:
type(a)

list

In [15]:
[a,a]

[[2, 4, 5], [2, 4, 5]]

In [16]:
type([a,a])

list

In [17]:
""

''

In [19]:
None

In [21]:
# Operators

In [22]:
1+3

4

In [23]:
"1"+"2"

'12'

In [24]:
"1"+1

TypeError: can only concatenate str (not "int") to str

In [25]:
type("!")

str

In [30]:
# Tuple
a = (12,35)

In [27]:
a

(12, 35)

In [28]:
type(a)

tuple

In [31]:
a[0]

12

In [32]:
list1 = [3,4,5,6]

In [33]:
list1[4]

IndexError: list index out of range

In [34]:
list1[2]

5

In [35]:
marks = [35,26,37,48,27]

In [36]:
passing_marks = 30

In [38]:
# Comparison Operator
marks[0] > passing_marks

True

In [43]:
if marks[0] > passing_marks:
    print("You passed Buddy!")

You passed Buddy!

In [44]:
for i in range(4):
    print(i)

0
1
2
3

In [45]:
for i in range(len(marks)):
    print(marks[i])

35
26
37
48
27

In [47]:
for mark in marks:
    print(mark)
    if mark < passing_marks:
        print("Fail!!!")
    else:
        print("Pass!!!")
    print("----------------")

35
Pass!!!
----------------
26
Fail!!!
----------------
37
Pass!!!
----------------
48
Pass!!!
----------------
27
Fail!!!
----------------

In [48]:
marks

[35, 26, 37, 48, 27]

In [50]:
for mark in marks:
    print(mark)
    if(mark < passing_marks) & (mark > 25):
        print("Grace")
    elif(mark < passing_marks) & (mark < 25):
        print("Fail")
    else:
        print("Pass")
    print("-----------------")

35
Pass
-----------------
26
Grace
-----------------
37
Pass
-----------------
48
Pass
-----------------
27
Grace
-----------------

In [51]:
marks

[35, 26, 37, 48, 27]

In [55]:
range(15)

range(0, 15)

In [56]:
x = range(1,15,2)
x

range(1, 15, 2)

In [57]:
for i in x:
    print(i)

1
3
5
7
9
11
13

In [65]:
x = int(input("Enter the number: "))
if(x%2 == 0):
    print("Divided by 2.")
elif(x%3 == 0):
    print("Divisible by 3.")
else:
    print("Not divisible by 2 or 3.")

Enter the number: 36
Divided by 2.

In [66]:
# Functions

In [67]:
def summ(a,b):
    return a+b

In [68]:
summ(2,7)

9

In [75]:
def diff(num1,num2):
    print(num1)
    for i in range(5):
        print(num1 - num2)
        num1 = num1 - num2

In [76]:
diff(20,3)

20
17
14
11
8
5

## Python for DS

In [77]:
# Packages that will be used:
# Pandas, NumPy, SciPy, Skilearn, Matplolib

In [78]:
import pandas as pd
import numpy as np

In [82]:
height = range(1,24,3)

In [83]:
height

range(1, 24, 3)

In [84]:
height_Series = pd.Series(height)

In [85]:
height_Series

0     1
1     4
2     7
3    10
4    13
5    16
6    19
7    22
dtype: int64

In [86]:
# Series is a labelled data structure.

In [87]:
height_Series.index

RangeIndex(start=0, stop=8, step=1)

In [90]:
height_Series.values

array([ 1,  4,  7, 10, 13, 16, 19, 22], dtype=int64)

In [91]:
height_Series[1:4]

1     4
2     7
3    10
dtype: int64

In [92]:
height_Series[2:]

2     7
3    10
4    13
5    16
6    19
7    22
dtype: int64

In [93]:
height_Series[:]

0     1
1     4
2     7
3    10
4    13
5    16
6    19
7    22
dtype: int64

In [95]:
height_Series[2] = None

In [96]:
height_Series

0     1.0
1     4.0
2     NaN
3    10.0
4    13.0
5    16.0
6    19.0
7    22.0
dtype: float64

In [97]:
height_Series.value_counts()

1.0     1
4.0     1
10.0    1
13.0    1
16.0    1
19.0    1
22.0    1
dtype: int64

In [104]:
df = pd.DataFrame([height,height])

In [105]:
df

   0  1  2   3   4   5   6   7
0  1  4  7  10  13  16  19  22
1  1  4  7  10  13  16  19  22

In [106]:
df.T

    0   1
0   1   1
1   4   4
2   7   7
3  10  10
4  13  13
5  16  16
6  19  19
7  22  22

In [108]:
df[:1] = df[:1]+2

In [111]:
df = df.T

In [112]:
df

    0   1
0   3   1
1   6   4
2   9   7
3  12  10
4  15  13
5  18  16
6  21  19
7  24  22

In [115]:
df.columns = ['class1','class2']

In [116]:
df

   class1  class2
0       3       1
1       6       4
2       9       7
3      12      10
4      15      13
5      18      16
6      21      19
7      24      22

In [120]:
df1 = pd.read_csv("q3.csv")

In [121]:
df1

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia
...,...,...,...,...,...,...,...,...,...,...
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada
99999,CA006137361,1966,1,-7.85,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

In [122]:
df1.head()

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia

In [123]:
df1.tail()

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada
99999,CA006137361,1966,1,-7.85,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

In [124]:
df1['locationid']

0        USS0010K01S
1        CI000085406
2        USC00036376
3        ASN00024002
4        ASN00028007
            ...
99995    MXXLT347415
99996    RSM00032287
99997    ARM00087166
99998    CA006137361
99999    CA006137361
Name: locationid, Length: 100000, dtype: object

In [125]:
type(df1)

pandas.core.frame.DataFrame

In [126]:
type(df['locationid'])

pandas.core.series.Series

In [127]:
df1['year'].value_counts()

2004    1235
2007    1226
1974    1207
1989    1206
1998    1205
        ...
1728       1
1736       1
1741       1
1749       1
1766       1
Name: year, Length: 270, dtype: int64

In [128]:
df1.shape

(100000, 10)

In [130]:
df1.isna().sum()

locationid        0
year              0
month             0
temp          14446
latitude          0
longitude         0
stnelev           0
station           0
countryid         0
country           5
dtype: int64

In [133]:
df1.fillna(0)

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,0.00,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia
...,...,...,...,...,...,...,...,...,...,...
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada
99999,CA006137361,1966,1,-7.85,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

In [134]:
df1.columns

Index(['locationid', 'year', 'month', 'temp', 'latitude', 'longitude',
       'stnelev', 'station', 'countryid', 'country'],
      dtype='object')

In [135]:
cols = ['year','temp']

In [137]:
df[cols]

       year   temp
0      2000   5.27
1      1940  18.04
2      2013   6.22
3      1963  22.93
4      2001    NaN
...     ...    ...
99995  1991  29.02
99996  1991  -2.81
99997  1937  19.42
99998  1958  10.02
99999  1966  -7.85

[100000 rows x 2 columns]

In [138]:
# Dictionaries

In [139]:
height

range(1, 24, 3)

In [140]:
len(height)

8

In [145]:
sname = list('abcdefgh')

In [146]:
sname

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [143]:
type(sname)

list

In [144]:
len(height)

8

In [149]:
height = [46,23,45,24,35,37,76,45]

In [150]:
dict1 = {'s.no':sname,'height':height}

In [151]:
dict1

{'s.no': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'],
 'height': [46, 23, 45, 24, 35, 37, 76, 45]}

In [152]:
df2 = pd.DataFrame(dict1)

In [153]:
df2

  s.no  height
0    a      46
1    b      23
2    c      45
3    d      24
4    e      35
5    f      37
6    g      76
7    h      45

In [154]:
df.year.value_counts()

2004    1235
2007    1226
1974    1207
1989    1206
1998    1205
        ...
1728       1
1736       1
1741       1
1749       1
1766       1
Name: year, Length: 270, dtype: int64

In [155]:
df

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia
...,...,...,...,...,...,...,...,...,...,...
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada
99999,CA006137361,1966,1,-7.85,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

In [156]:
df['month']>4

0        False
1         True
2         True
3        False
4         True
         ...
99995    False
99996     True
99997    False
99998     True
99999    False
Name: month, Length: 100000, dtype: bool

In [158]:
df[df['month']>4].count()

locationid    66653
year          66653
month         66653
temp          56835
latitude      66653
longitude     66653
stnelev       66653
station       66653
countryid     66653
country       66649
dtype: int64

In [159]:
df.shape

(100000, 10)

In [160]:
df1.shape

(100000, 10)

In [161]:
df2.shape

(8, 2)

In [162]:
df[(df['month']>4)&(df['temp']>20)]

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
8,FRM00007579,1996,8,21.87,44.1330,4.8330,55.0,ORANGE,FR,France
33,EG000062432,1970,7,30.92,25.4831,29.0000,107.0,DAKHLA,EG,Egypt
34,USC00040227,1950,6,20.27,38.0167,-121.7667,8.5,ANTIOCH_FIBREBRD_MILLS,US,United States
44,USC00344451,1995,9,21.88,33.9336,-94.8278,111.3,IDABEL,US,United States
47,ASN00033013,2008,12,29.77,-20.5534,147.8464,196.0,COLLINSVILLE_POST_OFFICE,AS,Australia
...,...,...,...,...,...,...,...,...,...,...
99967,MXM00076687,2005,7,20.90,19.5500,-96.9170,1389.0,JALAPAVER,MX,Mexico
99970,USC00127646,1894,7,23.43,39.6042,-85.4528,292.6,RUSHVILLE,US,United States
99975,JA000047615,1972,7,24.96,36.5500,139.8670,140.0,UTSUNOMIYA,JA,Japan
99978,USC00515864,1910,10,24.28,21.9189,-159.6278,42.7,MAKAWELI_965,US,United States
99986,MAXLT248119,1936,7,20.25,-12.3000,49.1800,30.0,DIEGO_SUAREZ,MA,Madagascar

In [163]:
df[(df['month']>4)&(df['temp']>20)].count()

locationid    16715
year          16715
month         16715
temp          16715
latitude      16715
longitude     16715
stnelev       16715
station       16715
countryid     16715
country       16715
dtype: int64

In [164]:
df.corr()

               year     month      temp  latitude  longitude   stnelev
year       1.000000 -0.000873  0.010263 -0.030330   0.017549  0.016371
month     -0.000873  1.000000  0.152352  0.003395   0.004964 -0.002225
temp       0.010263  0.152352  1.000000 -0.397717   0.071065 -0.060881
latitude  -0.030330  0.003395 -0.397717  1.000000  -0.338208 -0.050871
longitude  0.017549  0.004964  0.071065 -0.338208   1.000000 -0.092062
stnelev    0.016371 -0.002225 -0.060881 -0.050871  -0.092062  1.000000

In [166]:
v1 = [1,2,4,5,6]

In [169]:
df.describe()

,year,month,temp,latitude,longitude,stnelev
count,100000.000000,100000.000000,85554.000000,100000.000000,100000.000000,100000.000000
mean,1969.458030,6.494640,10.920770,35.075456,-38.123732,565.562545
std,35.836832,3.446463,11.522444,23.545646,84.297049,1073.647214
min,1720.000000,1.000000,-70.700000,-90.000000,-179.983000,-350.000000
25%,1949.000000,3.000000,3.460000,33.190675,-101.657925,64.000000
50%,1975.000000,6.000000,12.220000,40.793050,-79.568300,240.800000
75%,1998.000000,9.000000,19.570000,47.424700,17.533100,644.700000
max,2020.000000,12.000000,39.950000,82.516700,179.750000,9999.000000